# -*- coding: utf-8 -*-

# //////////////////////////////////////////////////////////
# //
# //                Функция enumerate(),
# //  возвращает генератор, отдающий пары счётчик-элемент
# //      для элементов указанной последовательности
# //

HEADLINE: str = ' Функция enumerate(), объединяет два списка попарно в картежи  '

print('\n')
print(HEADLINE.center(80, '*'), '\n')

s = 'Andrey_Ivantsov'

# без использования функции enumerate()
a = 0
for i in s:
    print(i, '-->', a, end='; ')
    a += 1

print('\n')

# с использованием функции enumerate()
for (a, i) in enumerate(s):
    print(i, '-->', a, end='; ')

