# -*- coding: utf-8 -*-

# //////////////////////////////////////////////////////////
# //
# //                  Кортежи - Cortege
# //

a = ()                # Пустой кортеж
b = (1,)              # Кортеж из одного элемента
c = (3, 'Murmansk',)  # Кортеж из дух элементов
print(a, b, c, '\n')

# Конкатенация

d = a + b + c
print(d, '\n')

# Изменение элементов кортежа

e = []
f = {}
g = (e, f,)
print(g)

e.append('First')
e.append('Second')
f['first'] = 'Первый'
f['second'] = 'Второй'
print(g, '\n')

# Преобразования

h = (4, 5.43, 'string', ['n', 'm'], {'color': 'white'})
print(h, 'кортеж')

# list() - преобразует кортеж в список

w = list(h)
w.append('new item')
print(w, 'кортеж в список')

# tuple() - преобразует список в кортеж

r = tuple(w)
print(r, 'список в кортеж', '\n')

# методы для кортежей (их всего два)

x = (2, 80, 50, 20, 80, 3, 6, 30, 80, 43)
print(x)

# index() - первое вхождение

z = x.index(80)
print(z, '- первое вхождение 80')

# count() - количество заданных элементов в кортеже
y = x.count(80)
print(y, '- число раз встречается 80', '\n')

# Срезы для кортежей
print(x[3:6], '- срез [3:6]')




